import React from "react";
import Cards from "../Main/Cards/Cards";
import { MoreContainer } from "./StyledMoreNews";

const data = [
  {
    date: "2 ИЮНЬ 2021",
    headerTitle: "Палата фаолиятининг долзарб масалалари",
    smallTitle:
      "30 июнь куни Кострома вилояти Президенти маъмурияти кенгашининг йиғилиши бўлиб ўтди",
  },
  {
    date: "2 ИЮНЬ 2021",
    headerTitle: "Палата фаолиятининг долзарб масалалари",
    smallTitle:
      "30 июнь куни Кострома вилояти Президенти маъмурияти кенгашининг йиғилиши бўлиб ўтди",
  },
  {
    date: "2 ИЮНЬ 2021",
    headerTitle: "Палата фаолиятининг долзарб масалалари",
    smallTitle:
      "30 июнь куни Кострома вилояти Президенти маъмурияти кенгашининг йиғилиши бўлиб ўтди",
  },
  {
    date: "2 ИЮНЬ 2021",
    headerTitle: "Палата фаолиятининг долзарб масалалари",
    smallTitle:
      "30 июнь куни Кострома вилояти Президенти маъмурияти кенгашининг йиғилиши бўлиб ўтди",
  },
  {
    date: "2 ИЮНЬ 2021",
    headerTitle: "Палата фаолиятининг долзарб масалалари",
    smallTitle:
      "30 июнь куни Кострома вилояти Президенти маъмурияти кенгашининг йиғилиши бўлиб ўтди",
  },
  {
    date: "2 ИЮНЬ 2021",
    headerTitle: "Палата фаолиятининг долзарб масалалари",
    smallTitle:
      "30 июнь куни Кострома вилояти Президенти маъмурияти кенгашининг йиғилиши бўлиб ўтди",
  },
  {
    date: "2 ИЮНЬ 2021",
    headerTitle: "Палата фаолиятининг долзарб масалалари",
    smallTitle:
      "30 июнь куни Кострома вилояти Президенти маъмурияти кенгашининг йиғилиши бўлиб ўтди",
  },
  {
    date: "2 ИЮНЬ 2021",
    headerTitle: "Палата фаолиятининг долзарб масалалари",
    smallTitle:
      "30 июнь куни Кострома вилояти Президенти маъмурияти кенгашининг йиғилиши бўлиб ўтди",
  },
  {
    date: "2 ИЮНЬ 2021",
    headerTitle: "Палата фаолиятининг долзарб масалалари",
    smallTitle:
      "30 июнь куни Кострома вилояти Президенти маъмурияти кенгашининг йиғилиши бўлиб ўтди",
  },
  {
    date: "2 ИЮНЬ 2021",
    headerTitle: "Палата фаолиятининг долзарб масалалари",
    smallTitle:
      "30 июнь куни Кострома вилояти Президенти маъмурияти кенгашининг йиғилиши бўлиб ўтди",
  },
  {
    date: "2 ИЮНЬ 2021",
    headerTitle: "Палата фаолиятининг долзарб масалалари",
    smallTitle:
      "30 июнь куни Кострома вилояти Президенти маъмурияти кенгашининг йиғилиши бўлиб ўтди",
  },
  {
    date: "2 ИЮНЬ 2021",
    headerTitle: "Палата фаолиятининг долзарб масалалари",
    smallTitle:
      "30 июнь куни Кострома вилояти Президенти маъмурияти кенгашининг йиғилиши бўлиб ўтди",
  },
];

const MoreNews = () => {
  return (
    <div>
      <MoreContainer>
        <MoreContainer width="1224px" margin="0 auto" gap="24px">
          {data.map((el) => (
            <Cards
              date={el.date}
              headerTitle={el.headerTitle}
              smallTitle={el.smallTitle}
            />
          ))}
        </MoreContainer>
      </MoreContainer>
    </div>
  );
};

export default MoreNews;
